MusicApp/app/models/user.rb

  def self.find_by_credential(email, password)
    @user = User.find_by(email: email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", ""], ["LIMIT", 1]]